# ChildrenLostOnGroupSwap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..ChildrenLostOnGroupSwap Property
BuiltInFailures..::..GroupFailures Class See Also
---
Some elements could not find new hosts after changing group type and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ChildrenLostOnGroupSwap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ChildrenLostOnGroupSwap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ChildrenLostOnGroupSwap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace